mateuszsikora/slate/spikes/s1-rebuild-idempotency/sdkconfig.defaults
# Spike S-1 — rebuild idempotency (design.md §13, §6.4).
#
# The only settings that matter here are the ones that decide *which heap* the
# widget tree lives in. Everything else is stock: this image never ships, and a
# partition table is deliberately not set because that is issue #5.

CONFIG_IDF_TARGET="esp32s3"

# --- Flash and PSRAM ---
# ESP32-S3-WROOM-1-N16R8 as read out of the silicon in #3: 16 MB quad flash,
# 8 MB octal PSRAM. Flash size is irrelevant to this spike; PSRAM is not.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# --- Task stack ---
# The measurement loop builds and tears down the tree on the main task. LVGL
# widget creation overruns the 3.5 KB default.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# --- LVGL heap (design.md §6.2) ---
# 2 MB, allocated from PSRAM through LV_MEM_POOL_ALLOC — see CMakeLists.txt.
# The built-in allocator is mandatory, not a preference: lv_mem_monitor() is
# implemented only for LV_STDLIB_BUILTIN, and the §13 pass criterion is stated
# in terms of exactly that function. Building this spike against clib malloc
# would report zeros and look like a pass.
CONFIG_LV_USE_BUILTIN_MALLOC=y
CONFIG_LV_MEM_SIZE_KILOBYTES=2048

CONFIG_LV_COLOR_DEPTH_16=y

# --- Fonts ---
# Stand-ins for the design.md §8 type scale (hero 44 / body 20 / caption 15).
# The real firmware ships its own bpp:4 faces from tools/fonts; the built-in
# Montserrat set is used here so this spike does not depend on the unmerged
# asset pipeline from #3. Glyph data is const and never allocated at runtime,
# so the substitution cannot affect a heap measurement.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_44=y

# --- Diagnostics ---
# Assert on a failed lv_malloc rather than dereferencing NULL somewhere later:
# an exhausted pool must be visible as an abort at the cycle it happened.
CONFIG_LV_USE_ASSERT_MALLOC=y
